system/OLDblockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// block definition for a porosity with an angled inlet/outlet
// the porosity is not aligned with the main axes
//
                             
convertToMeters 1;

vertices
(
    // inlet region
    //( -150  0  -25 )  // pt 0 (in1b) 
    //( -150 35.35533906  -25 ) // pt 1 (in2b) 
    //( -150  0  25 )  // pt 2 (in1f) 
    //( -150 35.35533906  25 ) // pt 3 (in2f) 

    // join inlet->outlet
    //(  0 0  -25 )    // pt 4 (join1b) 
    //( -35.35533906   35.35533906  -25 ) // pt 5 (join2b) 
    //(  0 0  25 )    // pt 6 (join1f) 
    //( -35.35533906   35.35533906  25 ) // pt 7 (join2f) 

    // porosity ends ->outlet
    //( 70.71067812 70.71067812  -25 )  // pt 8 (poro1b) 
    //( 35.35533906 106.06601718  -25 )  // pt 9 (poro2b) 
    //( 70.71067812 70.71067812  25 )  // pt 10 (poro1f) 
    //( 35.35533906 106.06601718  25 )  // pt 11 (poro2f) 

    // outlet
    //( 141.42135624 141.42135624 -25 ) // pt 12 (out1b) 
    //( 106.06601718 176.7766953 -25 ) // pt 13 (out2b) 
    //( 141.42135624 141.42135624 25 ) // pt 14 (out1f) 
    //( 106.06601718 176.7766953 25 ) // pt 15 (out2f)

  //Inlet
	(-5 -4 0) //0
	(-5 -4 1)  //1
	(-5 4 1)  //2
	(-5 4 0)  //3
  //inlet to porous
	(-1 -4 0) //4
	(-1 -4 1)  //5
	(-1  4 1)  //6
	(-1  4 0)  //7
  // porous to outlet
        (1 -4 0) //8
	(1 -4 1)  //9
	(1  4 1)  //10
	(1  4 0)  //11
 // Outlet
        (15 -4 0) //12
	(15 -4 1)  //13
	(15 4 1)  //14
	(15 4 0)  //15
);

blocks
(
    // inlet block
    hex (0 4 7 3 1 5 6 2)
    inlet (160 320 1 ) simpleGrading (1 1 1)

    // porosity block
    hex (4 8 11 7 5 9 10 6)
    porosity (80 320 1 ) simpleGrading (1 1 1)

    // outlet block
    hex (8 12 15 11 9 13 14 10)
    outlet (560 320 1 ) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (120 20 20) simpleGrading (1 1 1)

);


edges
(
);

patches
(
    // is there no way of defining all my 'defaultFaces' to be 'wall'?
    wall front
    (
    // inlet block
    (0 4 7 3)
    // outlet block
    (8 12 15 11)
    )

    wall back
    (
    // inlet block
    (1 5 6 2)
    // outlet block
    (9 13 14 10)
    )

    wall walls
    (
    // inlet block
    (0 4 5 1)
    (3 7 6 2)
    // outlet block
    (8 12 13 9)
    (11 15 14 10)
    )

    wall porosityWall
    (
    // porosity block
    (4 8 11 7)
    // porosity block
    (5 9 10 6)
    // porosity block
    (4 8 9 5)
    (7 11 10 6)
    )

    patch inlet
    (
    (0 1 2 3)
    )

    patch outlet
    (
    (12 13 14 15)
    )
    
    cyclic patch0
    (
    (4 5 6 7)
    (8 9 10 11)
    ) 
);

mergePatchPairs
(
);




/////////////////77
    patch0_half0
    {
        type cyclic;
        neighbourPatch patch0_half1;
        faces
        (
             (7 4 5 6)
        );
    }
    patch0_half1
    {
        type cyclic;
        neighbourPatch patch0_half0;
        faces
        (
             (11 8 9 10)
        );
    }
/////////////////

// ************************************************************************* //
