system/pressureDifferencePatch
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the difference between the average pressures on 2 specified
    patches.

\*---------------------------------------------------------------------------*/
pressureDifferencePatch
{
	patch1 inlet;
	patch2 outlet;

#includeEtc "caseDicts/postProcessing/pressure/pressureDifferencePatch.cfg"
}

// ************************************************************************* //
